code-review/NRB_3471_3546/База_Было/InformationRegisters/ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиОнлайнЗагрузкиИзВнешнихИсточников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИВремяОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешнийИсточник</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ОшибкиОнлайнЗагрузкиИзВнешнихИсточников/Forms/ОшибкиЗагрузкиСообщений/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ЗначенияЗаполнения.Свойство("ВнешнийИсточник",ВнешнийИсточник);
	Параметры.ЗначенияЗаполнения.Свойство("ОбработчикЗагрузки",ОбработчикЗагрузки);
	Если ЗначениеЗаполнено(ВнешнийИсточник) Тогда 
		ЗаполнитьТаблицуНаСервере();
	КонецЕсли;
	
КонецПроцедуры                             

&НаСервере
Функция ЗаполнитьТаблицуНаСервере()
	
	СообщенияСОшибками =  РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.ПолучитьСообщенияТаблица(ВнешнийИсточник);
	Сообщения.Загрузить(СообщенияСОшибками);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	ЗаполнитьТаблицуНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСообщенияНаСервере(СообщениеОбОшибке)
	Обр = Обработки[ОбработчикЗагрузки].Создать();
	тзн = РеквизитФормыВЗначение("Сообщения",Тип("ТаблицаЗначений"));
	Обр.ОбработкаОшибокОнлайнЗагрузки(тзн,СообщениеОбОшибке);
	ЗначениеВРеквизитФормы(тзн, "Сообщения");
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщения(Команда)
	СообщениеОбОшибке = "";
	ЗагрузитьСообщенияНаСервере(СообщениеОбОшибке);
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибки загрузки сообщений: "+Символы.ПС+СообщениеОбОшибке);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСообщенияНаСервере(ВнешнийИсточник)
	тзн = РеквизитФормыВЗначение("Сообщения",Тип("ТаблицаЗначений"));
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.УдалитьСообщенияВТаблице(ВнешнийИсточник,тзн);
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСообщения(Команда)
	Если Вопрос("Отмеченные сообшения будут удалены из очереди без возможности восстановления. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
		УдалитьСообщенияНаСервере(ВнешнийИсточник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	Сообщения.Очистить();
КонецПроцедуры

&НаКлиенте
Функция ОбновитьТекущееСообщение()
	Если ПоказыватьТекстСообщения Тогда 
		Элементы.ТекстСообщения.Видимость = Истина;
		ТС = Элементы.Сообщения.ТекущиеДанные;
		Если ТС<>Неопределено Тогда
			ТекстСообщения = ТС.Сообщение;
		КонецЕсли;
	Иначе 
		ТекстСообщения = "";
		Элементы.ТекстСообщения.Видимость = Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СообщенияПриАктивизацииСтроки(Элемент)
	ОбновитьТекущееСообщение();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТекстСообщенияПриИзменении(Элемент)
	ОбновитьТекущееСообщение();
КонецПроцедуры
